diff tests/idct/oracle/ieee_1180_1990.res.oracle tests/idct/oracle_legacy/ieee_1180_1990.res.oracle
48d47
< tests/idct/idct.c:163:[value] warning: 2's complement assumed for overflow
49a49
> tests/idct/idct.c:163:[value] warning: 2's complement assumed for overflow
52d51
< tests/idct/idct.c:176:[value] warning: 2's complement assumed for overflow
53a53
> tests/idct/idct.c:176:[value] warning: 2's complement assumed for overflow
117d116
< tests/idct/ieee_1180_1990.c:109:[value] warning: accessing uninitialized left-value. assert \initialized(&(*(m1 + k))[j]);
170d168
< tests/idct/idct.c:129:[value] warning: 2's complement assumed for overflow
171a170
> tests/idct/idct.c:129:[value] warning: 2's complement assumed for overflow
176,177d174
< tests/idct/ieee_1180_1990.c:218:[value] warning: 2's complement assumed for overflow
< tests/idct/ieee_1180_1990.c:218:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
178a176,177
> tests/idct/ieee_1180_1990.c:218:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
> tests/idct/ieee_1180_1990.c:218:[value] warning: 2's complement assumed for overflow
187d185
< tests/idct/ieee_1180_1990.c:235:[value] warning: accessing uninitialized left-value. assert \initialized(&M1[j][k]);
202,203d199
< tests/idct/ieee_1180_1990.c:242:[value] warning: 2's complement assumed for overflow
< tests/idct/ieee_1180_1990.c:242:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
204a201,202
> tests/idct/ieee_1180_1990.c:242:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
> tests/idct/ieee_1180_1990.c:242:[value] warning: 2's complement assumed for overflow
230,231d227
< tests/idct/ieee_1180_1990.c:264:[value] warning: 2's complement assumed for overflow
< tests/idct/ieee_1180_1990.c:264:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
232a229,230
> tests/idct/ieee_1180_1990.c:264:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
> tests/idct/ieee_1180_1990.c:264:[value] warning: 2's complement assumed for overflow
241d238
< tests/idct/ieee_1180_1990.c:281:[value] warning: accessing uninitialized left-value. assert \initialized(&M1[j][k]);
247,248d243
< tests/idct/ieee_1180_1990.c:288:[value] warning: 2's complement assumed for overflow
< tests/idct/ieee_1180_1990.c:288:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
249a245,246
> tests/idct/ieee_1180_1990.c:288:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
> tests/idct/ieee_1180_1990.c:288:[value] warning: 2's complement assumed for overflow
275,276d271
< tests/idct/ieee_1180_1990.c:310:[value] warning: 2's complement assumed for overflow
< tests/idct/ieee_1180_1990.c:310:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
277a273,274
> tests/idct/ieee_1180_1990.c:310:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
> tests/idct/ieee_1180_1990.c:310:[value] warning: 2's complement assumed for overflow
286d282
< tests/idct/ieee_1180_1990.c:327:[value] warning: accessing uninitialized left-value. assert \initialized(&M1[j][k]);
292,293d287
< tests/idct/ieee_1180_1990.c:334:[value] warning: 2's complement assumed for overflow
< tests/idct/ieee_1180_1990.c:334:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
294a289,290
> tests/idct/ieee_1180_1990.c:334:[value] warning: accessing uninitialized left-value. assert \initialized(&m3[j][k]);
> tests/idct/ieee_1180_1990.c:334:[value] warning: 2's complement assumed for overflow
512c508
<   M1[0..7][0..7] ∈ [--..--] or UNINITIALIZED
---
>   M1[0..7][0..7] ∈ [--..--]
564c560
<   M1[0..7][0..7] ∈ [--..--] or UNINITIALIZED
---
>   M1[0..7][0..7] ∈ [--..--]
2302,2304d2297
<             assert Value: initialisation: \initialized(&(*(m1 + k))[j]);
<             tried with Value.
< [    -    ] Assertion 'Value,initialisation' (file tests/idct/ieee_1180_1990.c, line 109)
2401c2394
<             assert Value: initialisation: \initialized(&m3[j][k]);
---
>             assert Value: initialisation: \initialized(&m4[j][k]);
2404c2397
<             assert Value: initialisation: \initialized(&m4[j][k]);
---
>             assert Value: initialisation: \initialized(&m3[j][k]);
2412,2414d2404
< [    -    ] Assertion 'Value,initialisation' (file tests/idct/ieee_1180_1990.c, line 235)
<             assert Value: initialisation: \initialized(&M1[j][k]);
<             tried with Value.
2416c2406
<             assert Value: initialisation: \initialized(&m3[j][k]);
---
>             assert Value: initialisation: \initialized(&m4[j][k]);
2419c2409
<             assert Value: initialisation: \initialized(&m4[j][k]);
---
>             assert Value: initialisation: \initialized(&m3[j][k]);
2428c2418
<             assert Value: initialisation: \initialized(&m3[j][k]);
---
>             assert Value: initialisation: \initialized(&m4[j][k]);
2431c2421
<             assert Value: initialisation: \initialized(&m4[j][k]);
---
>             assert Value: initialisation: \initialized(&m3[j][k]);
2439,2441d2428
< [    -    ] Assertion 'Value,initialisation' (file tests/idct/ieee_1180_1990.c, line 281)
<             assert Value: initialisation: \initialized(&M1[j][k]);
<             tried with Value.
2443c2430
<             assert Value: initialisation: \initialized(&m3[j][k]);
---
>             assert Value: initialisation: \initialized(&m4[j][k]);
2446c2433
<             assert Value: initialisation: \initialized(&m4[j][k]);
---
>             assert Value: initialisation: \initialized(&m3[j][k]);
2455c2442
<             assert Value: initialisation: \initialized(&m3[j][k]);
---
>             assert Value: initialisation: \initialized(&m4[j][k]);
2458c2445
<             assert Value: initialisation: \initialized(&m4[j][k]);
---
>             assert Value: initialisation: \initialized(&m3[j][k]);
2466,2468d2452
< [    -    ] Assertion 'Value,initialisation' (file tests/idct/ieee_1180_1990.c, line 327)
<             assert Value: initialisation: \initialized(&M1[j][k]);
<             tried with Value.
2470c2454
<             assert Value: initialisation: \initialized(&m3[j][k]);
---
>             assert Value: initialisation: \initialized(&m4[j][k]);
2473c2457
<             assert Value: initialisation: \initialized(&m4[j][k]);
---
>             assert Value: initialisation: \initialized(&m3[j][k]);
2510,2511c2494,2495
<     60 To be validated
<    439 Total
---
>     56 To be validated
>    435 Total
